Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/family_benefits_and_entitlements.html.txt.tmx
Source language: en
Languages: ga

source: Family benefits and entitlements
ga: Sochair agus teidlíochtaí teaghlaigh

source: There is a range of social welfare, tax and employment related benefits and entitlements available to families in Ireland, depending on their circumstances
ga: Ag brath ar stádas teaghlaigh, féadfaidh daoine atá ina gcónaí in Éirinn leas a bhaint as raon de shochair agus de theidlíochtaí leasa shóisialaigh de réir cánach agus fostaíochta

source: The Department of Social Protection provides social welfare payments to support families including cohabiting couples and civil partnerships, particularly those with children
ga: Tugann an Roinn Coimirce Sóisialaí íocaíochtaí leasa shóisialaigh chun tacú le teaghlaigh ina n-áirítear lánúineacha comhchónaitheacha agus páirtnéireachtaí sibhialta, go háirithe iad siúd le leanaí

source: These payments are both means-tested and based on social insurance contributions
ga: Tá na híocaíochtaí seo tástáilte ó thaobh acmhainne agus bunaithe ar ranníocaíochtaí árachas sóisialta

source: Supports are also available for those in low-paid employment and for parents bringing children up without the support of a partner
ga: Tá tacaíochtaí ar fáil chomh maith dóibh siúd i bhfostaíocht ar phá íseal agus do thuismitheoirí atá ag tógáil leanaí gan tacaíocht ó pháirtí

source: There are also payments for orphans
ga: Tá íocaíochtaí ann chomh maith do dhíleachtaí

source: Read about the various social welfare payments that are available here
ga: Léigh faoi na híocaíochtaí leasa shóisialaigh éagsúla atá ar fáil anseo

source: Under EU regulations EU/EEA citizens and Swiss nationals who are employed or self-employed in Ireland and subject to the Irish Social Insurance system, do not have to satisfy the habitual residence condition to qualify for Family Benefits
ga: Faoi rialacháin AE, ní chaithfidh saoránaigh AE/LEE agus náisiúnaithe Eilbhéiseacha atá fostaithe nó féin-fhostaithe in Éirinn agus atá faoi réir chóras árachas sóisialta na hÉireann an coinníoll gnáthchónaithe a shásamh chun cáiliú do Shochair Teaghlaigh

source: In the year of marriage or registration of civil partnership, you are treated as being single for taxation purposes
ga: I mbliain phósta no cláraithe na páirtnéireachtaí sibhialta, caitear leat ar nós duine singil do chúiseanna cánachais

source: If however, you would have paid less tax had you been treated as married or a civil partner, you can claim a refund
ga: Dá n-íocfá níos lú cáin dá gcaithfí leat mar dhuine pósta no páirtnéir sibhialta, áfach, is féidir leat cur isteach ar aisíocaíocht

source: For subsequent years married people and civil partners can choose from three taxation options
ga: Do bhlianta iarshnígh, is féidir le daoine pósta nó páirtnéirí sibhialta rogha a dhéanamh idir trí rogha

source: There are no specific tax reliefs for children
ga: Níl aon fhaoisimh chánacha sonraithe do leanaí

source: There is, however, an Incapaciated Child Tax Credit if your child is permanently incapacitated and a Home Carer's Tax Credit where one spouse is caring for a dependant such as a child
ga: Tá Creidmheas Cánach do Leanbh Éagmusach má tá éagmus buan ar do leanbh, áfach, agus Creidmheas Cánach do Chúramóir Teaghlaigh, áit a bhfuil céile amháin ag cúram do chleithiúnach ar nós linbh

source: The Revenue Commissioner's leaflet on the Home Carer's Tax Credit is available here (pdf) while information on tax reliefs for people with disabilities is available here
ga: Tá bileog ar Chreidmheas Cánach do Chúramóir Teaghlaigh ar fáil anseo(pdf) na gCoimisinéirí Ioncam, agus tá eolas ar fhaoisimh chánacha do dhaoine faoi mhíchumas ar fáil anseo

source: There are specific tax reliefs for one-parent families
ga: Tá faoisimh chánacha do theaghlaigh aonteaghlaigh ann

source: There are also other tax credits and allowances which families can avail of
ga: Tá creidmheasanna cánacha agus liúntais ar féidir le teaghlaigh a fháil chomh maith

source: There are both employment-related entitlements and social welfare payments that you may be able to avail of related to the birth of a child
ga: D’fhéadfadh go mbeifeá ábalta leas a bhaint as teidlíochtaí de réir fostaíochta agus as íocaíochtaí leasa shóisialaigh a bhainfeadh le breith do linbh

source: If you are entitled to parental leave you can take unpaid leave to look after children without affecting most of your employment rights
ga: Má tá tú i dteideal saoire thuismitheoirí, féadfaidh tú saoire gan íocaíocht a ghlacadh le haire a thabhairt do leanaí, agus sin a dhéanamh gan éifeacht a bheith aige ar mhórchuid de do chearta fostaíochta

source: There are certain once-off payments provided by Department of Social Protection that are available to help out families around the time of bereavement
ga: Cuireann an an Roinn Coimirce Sóisialaí íocaíochtaí aon uaire áirithe ar fáil mar chúnamh i gcás báis sa teaghlach

source: There are, for example, grants to help with funeral costs
ga: Cuirtear deontais ar fáil, mar shampla, le cúnamh a thabhairt le costais sochraide

source: There are also specific rules about taxation in the year of a person's death and tax credits for widows and surviving civil partners
ga: Tá rialacha faoi leith ann freisin i dtaobh cánachais sa bhliain inar bhásaigh duine agus i dtaobh creidmheasanna cánach le haghaidh baintreach agus páirtnéirí sibhialta mharthanaigh
